除了print,你知道pprint吗？它能打印的更美观

很多朋友知道print,但不知道pprint
pprint和print都是python的打印模块，功能基本一样，唯一的区别就是
pprint打印出来的数据结构更加美观漂亮，更加方便阅读打印输出结果。特别是对于特别长的数据打印
print输出结果都在一行，不方便查看

from pprint import pprint

dic = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    }, "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    }
}

print(dic)
'''
输出
{'王力宏': {'部门': '科技部', '工资': 3000, '级别': 1}, '周杰伦': {'部门': '市场部', '工资': 5000, '级别': 2}}
'''

pprint(dic)
'''
输出
{'周杰伦': {'工资': 5000, '级别': 2, '部门': '市场部'},
 '王力宏': {'工资': 3000, '级别': 1, '部门': '科技部'}}
'''

# width控制每行输出的宽度

pprint(dic,width=10)
'''
输出
{'周杰伦': {'工资': 5000,
         '级别': 2,
         '部门': '市场部'},
 '王力宏': {'工资': 3000,
         '级别': 1,
         '部门': '科技部'}}
'''

pprint(dic,indent=5)
'''
输出
{    '周杰伦': {'工资': 5000, '级别': 2, '部门': '市场部'},
     '王力宏': {'工资': 3000, '级别': 1, '部门': '科技部'}}

'''
