什么是面向过程(函数式)和面向对象(class类)编程？


面向过程编程，注重于解决问题的步骤。例如把大象装进冰箱，一共分三步，打开冰箱门，把大象装进去，关上冰箱门即可。
他首先先拿到数据，再思考如何去储存和运算这些数据。

面向过程是一种执行者的思维，强调如何取解决，即使很多事情很难解决。

面向对象是一种设计者的思维，强调如何规划设计，相当于司令来统筹各方兵力。

python是面向对象编程的一门语言，具有面向对象的继承，多态，封装等特性。
python一切都是对象，小到以数字，大到一个类，一个模块都是对象，可以这么理解：凡是能存到内存里的数据或是代码集合都可以称为一个对象。

面向对象编程是一种编程思维，他并不是和面向过程编程是分道扬礁的，而是相辅相成的，任何事情的处理最终都是面向过程来完成的。

面向对象编程常用于开发复杂的大型软件，而不是简单的打印一个九九乘法表。比如造一辆车，我们很难按照面向过程那样按步骤来造成车辆。但是，假如把车的发动机，轮胎，车架都给我们，那么造车也是一件很容易的事情，我们只需把他们组装起来，如何来组装这个问题又回到了面向过程编程来了。

面向对象编程使程序的扩展性更强、可读性更好，使编程可以像搭积木一样简单。面向对象编程将数据和操作数据相关的方法封装到对象中，组织代码和数据的方式更加接近人的思维，从而大大提高了编程的效率。

我个人感觉并无好坏之分，面向对象更适用于框架系统性编码，面向过程更适用于独立性编码，单兵作战



